C-c ' - редактирование ячеек
S-Tab - развернуть/схлопнуть
C-c { - режим debugging
С-с } - отображение индексов таблицы под курсором

* 2015-2019
** Tariffs
#+TBLNAME: tariffs
|----------------+--------------+---------------+-----------+---------------+-----------------|
| Услуга         | Горячая вода | Холодная вода | Водоотвод | Электричество | Взносы, антенна |
|                |        м3/м3 |         м3/м3 |           |         кВт/ч |        и прочее |
|----------------+--------------+---------------+-----------+---------------+-----------------|
| Цена           |       135.79 |         29.16 |     20.69 |          3.28 |                 |
| с июля 2015    |       151.36 |         30.87 |     21.90 |          3.52 |                 |
| с августа 2015 |       163.24 |         33.03 |     23.43 |          3.77 |                 |
| с июля 2017    |       180.55 |         35.40 |     25.12 |          4.04 |         4652.78 |
| с июля 2018    |       180.55 |         35.40 |     25.12 |          4.04 |         4713.69 |
| с августа 2018 |       188.53 |         38.06 |     27.01 |          4.30 |         4713.69 |
| с декабря 2018 |       188.53 |         38.06 |     27.01 |          4.30 |         4718.16 |
| с января 2019  |       188.53 |         38.06 |     27.01 |          4.37 |          4879.3 |
| с февраля 2019 |       191.72 |         38.70 |     27.41 |          4.37 |         5028.13 |
| с марта 2019   |       191.72 |         38.70 |     27.47 |          4.37 |         5028.13 |
| с апреля 2019  |       191.72 |         38.70 |     27.47 |          4.37 |         5033.65 |
| с июля 2019    |       191.72 |         38.70 |     27.47 |          4.37 |          5091.9 |
| с августа 2019 |       198.19 |         40.48 |     29.57 |          4.65 |          5091.9 |
| с сентября2019 |       198.19 |         40.48 |     29.57 |          4.65 |          5091.9 |
| с декабря 2019 |       198.19 |         40.48 |     29.57 |          4.65 |         5096.93 |
|----------------+--------------+---------------+-----------+---------------+-----------------|
#+TBLFM: @6$6=1659.74 + 1085.60 + 438.84 + 950.30 + 105.02 + 215.22 + 48 + 50 + 100.06::@7$6=1720.65 + 1085.60 + 438.84 + 950.30 + 105.02 + 215.22 + 48 + 50 + 100.06::@8$6=1720.65 + 1085.60 + 438.84 + 950.30 + 105.02 + 215.22 + 48 + 50 + 100.06::@9$6=1720.65 + 1085.60 + 438.84 + 950.30 + 105.02 + 215.22 + 48 + 50 + 104.53::@10$6=1749.81 + 1161.60 + 461.74 + 1016.82 + 106.80 + 230.00 + 48 + 104.53::@11$6=1898.64 + 1161.60 + 461.74 + 1016.82 + 106.80 + 230.00 + 48 + 104.53::@12$6=1898.64 + 1161.60 + 461.74 + 1016.82 + 106.80 + 230.00 + 48 + 104.53::@13$6=1898.64 + 1161.60 + 461.74 + 1016.82 + 112.32 + 230.00 + 48 + 104.53::@14$6=1956.89 + 1161.60 + 461.74 + 1016.82 + 112.32 + 230.00 + 48 + 104.53::@15$6=1956.89 + 1161.60 + 461.74 + 1016.82 + 112.32 + 230.00 + 48 + 104.53::@16$6=1956.89 + 1623.34 + 1016.82 + 112.32 + 230.00 + 48 + 104.53::@17$6=1956.89 + 1623.34 + 1016.82 + 112.32 + 230.00 + 48 + 109.56
** Bills
*** 2015
#+TBLNAME: bills2015
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |     Итого |                   Электричество |
|           |        м3/м3 |         м3/м3 |           |           |                           кВт/ч |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Январь    |              |               |           |           |                                 |
| показания |      122.719 |       111.187 |           |           |                          9108.3 |
| расход    |       3.6777 |        3.5235 |    7.2012 |           |                             156 |
|           |              |               |           |           |                                 |
| цена      |    499.39488 |     102.74526 | 148.99283 | 751.13297 |                          511.68 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Февраль   |              |               |           |           |                                 |
| показания |      127.613 |       115.186 |           |           |                          9249.9 |
| расход    |        4.894 |         3.999 |     8.893 |           |                           141.6 |
|           |              |               |           |           |                                 |
| цена      |    664.55626 |     116.61084 | 183.99617 | 965.16327 |                         464.448 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Март      |              |               |           |           |                                 |
| показания |      132.331 |       119.167 |           |           |                          9409.1 |
| расход    |        4.718 |         3.981 |     8.699 |           |                           159.2 |
|           |              |               |           |           |                                 |
| цена      |    640.65722 |     116.08596 | 179.98231 | 936.72549 |                         522.176 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Апрель    |              |               |           |           |                                 |
| показания |      137.277 |       123.732 |           |           |                          9597.7 |
| расход    |        4.946 |         4.565 |     9.511 |           |                           188.6 |
|           |              |               |           |           |                                 |
| цена      |    671.61734 |      133.1154 | 196.78259 | 1001.5153 |                         618.608 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Май       |              |               |           |           |                                 |
| показания |      141.675 |       127.655 |           |           |                          9765.8 |
| расход    |        4.398 |         3.923 |     8.321 |           |                           168.1 |
|           |              |               |           |           |                                 |
| цена      |    597.20442 |     114.39468 | 172.16149 | 883.76059 |                         551.368 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Июнь      |              |               |           |           |                                 |
| показания |      145.160 |       131.978 |           |           |                          9908.4 |
| расход    |        3.485 |         4.323 |     7.808 |           |                           142.6 |
|           |              |               |           |           |                                 |
| цена      |    473.22815 |     126.05868 | 161.54752 | 760.83435 |                         467.728 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Июль      |              |               |           |           |                                 |
| показания |      149.827 |       137.400 |           |           |                         10070.0 |
| расход    |        4.667 |         5.422 |    10.089 |           |                           161.6 |
|           |              |               |           |           |                                 |
| цена      |    633.73193 |     158.10552 | 208.74141 | 1000.5789 |                         568.832 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Август    |              |               |           |           |                                 |
| показания |      153.096 |       141.297 |           |           |                         10180.3 |
| расход    |        3.269 |         3.897 |     7.166 |           |                           110.3 |
|           |              |               |           |           |                                 |
| цена      |    494.79584 |     120.30039 |  156.9354 | 772.03163 |                         388.256 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Сентябрь  |              |               |           |           |                                 |
| показания |      156.064 |       144.095 |           |           |                         10263.6 |
| расход    |        2.968 |         2.798 |     5.766 |           |                            83.3 |
|           |              |               |           |           | свет 15.36 переплата => 277.856 |
| цена      |    449.23648 |      86.37426 |  126.2754 | 661.88614 |                         293.216 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Октябрь   |              |               |           |           |                                 |
| показания |      161.607 |       149.056 |           |           |                         10408.4 |
| расход    |        5.543 |         4.961 |    10.504 |           |                           144.8 |
|           |              |               |           |           |                                 |
| цена      |    838.98848 |     153.14607 |  230.0376 | 1222.1722 |                         509.696 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Ноябрь    |              |               |           |           |                                 |
| показания |      168.236 |       153.921 |           |           |                         10577.3 |
| расход    |        6.629 |         4.865 |    11.494 |           |                           168.9 |
|           |              |               |           |           |   свет 0.35 переплата => 594.18 |
| цена      |    1003.3654 |     150.18255 |  251.7186 | 1405.2666 |                         594.528 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Декабрь   |              |               |           |           |                                 |
| показания |      173.527 |       157.845 |           |           |                         10707.4 |
| расход    |        5.291 |         3.924 |     9.215 |           |                           130.1 |
|           |              |               |           |           |    свет 0.35 переплата => 457.6 |
| цена      |    800.84576 |     121.13388 |  201.8085 | 1123.7881 |                         457.952 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|

#+TBLFM: @5$4=$2 + $3::@7$2=@-2$2 * remote(tariffs, @3$2)::@7$3=@-2$3 * remote(tariffs, @3$3)::@7$4=@-2$4 * remote(tariffs, @3$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @3$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @3$2)::@12$3=@-2$3 * remote(tariffs, @3$3)::@12$4=@-2$4 * remote(tariffs, @3$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @3$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs, @3$2)::@17$3=@-2$3 * remote(tariffs, @3$3)::@17$4=@-2$4 * remote(tariffs, @3$4)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs, @3$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs, @3$2)::@22$3=@-2$3 * remote(tariffs, @3$3)::@22$4=@-2$4 * remote(tariffs, @3$4)::@22$5=$2 + $3 + $4::@22$6=@-2$6 * remote(tariffs, @3$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs, @3$2)::@27$3=@-2$3 * remote(tariffs, @3$3)::@27$4=@-2$4 * remote(tariffs, @3$4)::@27$5=$2 + $3 + $4::@27$6=@-2$6 * remote(tariffs, @3$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs, @3$2)::@32$3=@-2$3 * remote(tariffs, @3$3)::@32$4=@-2$4 * remote(tariffs, @3$4)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs, @3$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs, @3$2)::@37$3=@-2$3 * remote(tariffs, @3$3)::@37$4=@-2$4 * remote(tariffs, @3$4)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs, @4$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs, @4$2)::@42$3=@-2$3 * remote(tariffs, @4$3)::@42$4=@-2$4 * remote(tariffs, @4$4)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs, @4$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs, @4$2)::@47$3=@-2$3 * remote(tariffs, @4$3)::@47$4=@-2$4 * remote(tariffs, @4$4)::@47$5=$2 + $3 + $4::@47$6=@-2$6 * remote(tariffs, @4$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs, @4$2)::@52$3=@-2$3 * remote(tariffs, @4$3)::@52$4=@-2$4 * remote(tariffs, @4$4)::@52$5=$2 + $3 + $4::@52$6=@-2$6 * remote(tariffs, @4$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs, @4$2)::@57$3=@-2$3 * remote(tariffs, @4$3)::@57$4=@-2$4 * remote(tariffs, @4$4)::@57$5=$2 + $3 + $4::@57$6=@-2$6 * remote(tariffs, @4$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs, @4$2)::@62$3=@-2$3 * remote(tariffs, @4$3)::@62$4=@-2$4 * remote(tariffs, @4$4)::@62$5=$2 + $3 + $4::@62$6=@-2$6 * remote(tariffs, @4$5)::@65$2=@-1$2 - @-6$2::@65$3=@-1$3 - @-6$3::@65$4=$2 + $3::@65$6=@-1$6 - @-6$6::@67$2=@-2$2 * remote(tariffs, @4$2)::@67$3=@-2$3 * remote(tariffs, @4$3)::@67$4=@-2$4 * remote(tariffs, @4$4)::@67$5=$2 + $3 + $4::@67$6=@-2$6 * remote(tariffs, @4$5)

*** 2016
#+TBLNAME: bills2016
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |     Итого |             Электричество |
|           |        м3/м3 |         м3/м3 |           |           |                     кВт/ч |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Январь    |              |               |           |           |                           |
| показания |      180.367 |       163.222 |           |           |                   10850.5 |
| расход    |         6.84 |         5.377 |    12.217 |           |                     143.1 |
|           |              |               |           |           |                           |
| цена      |    1035.3024 |     165.98799 |  267.5523 | 1468.8427 |                   503.712 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Февраль   |              |               |           |           |                           |
| показания |      187.431 |       168.584 |           |           |                   10992.5 |
| расход    |        7.064 |         5.362 |    12.426 |           |                      142. |
|           |              |               |           |           |                           |
| цена      |    1069.2070 |     165.52494 |  272.1294 | 1506.8613 |                    499.84 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Март      |              |               |           |           |                           |
| показания |      195.288 |       175.530 |           |           |                   11152.0 |
| расход    |        7.857 |         6.946 |    14.803 |           |                     159.5 |
|           |              |               |           |           |                           |
| цена      |    1189.2355 |     214.42302 |  324.1857 | 1727.8442 |                    561.44 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Апрель    |              |               |           |           |                           |
| показания |      204.902 |       184.657 |           |           |                   11401.6 |
| расход    |        9.614 |         9.127 |    18.741 |           |                     249.6 |
|           |              |               |           |           | недоплата 1.76 => 880.352 |
| цена      |    1455.1750 |     281.75049 |  410.4279 | 2147.3534 |                   878.592 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Май       |              |               |           |           |                           |
| показания |      210.792 |       192.597 |           |           |                   11607.4 |
| расход    |         5.89 |          7.94 |     13.83 |           |                     205.8 |
|           |              |               |           |           |                           |
| цена      |     891.5104 |      245.1078 |   302.877 | 1439.4952 |                   724.416 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Июнь      |              |               |           |           |                           |
| показания |      219.085 |       201.703 |           |           |                   11839.2 |
| расход    |        8.293 |         9.106 |    17.399 |           |                     231.8 |
|           |              |               |           |           |                           |
| цена      |    1255.2285 |     281.10222 |  381.0381 | 1917.3688 |                   815.936 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Июль      |              |               |           |           |                           |
| показания |      224.527 |       209.953 |           |           |                   12018.6 |
| расход    |        5.442 |          8.25 |    13.692 |           |                     179.4 |
|           |              |               |           |           |                           |
| цена      |    823.70112 |      254.6775 |  299.8548 | 1378.2334 |                   631.488 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Август    |              |               |           |           |                           |
| показания |      225.959 |       212.307 |           |           |                   12105.7 |
| расход    |        1.432 |         2.354 |     3.786 |           |                      87.1 |
|           |              |               |           |           |                           |
| цена      |    233.75968 |      77.75262 |  88.70598 | 400.21828 |                   328.367 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Сентябрь  |              |               |           |           |                           |
| показания |      226.920 |        213.79 |           |           |                   12187.7 |
| расход    |        0.961 |         1.483 |     2.444 |           |                       82. |
|           |              |               |           |           |                           |
| цена      |    156.87364 |      48.98349 |  57.26292 | 263.12005 |                    309.14 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Октябрь   |              |               |           |           |                           |
| показания |      233.995 |       221.149 |           |           |                   12385.6 |
| расход    |        7.075 |         7.359 |    14.434 |           |                     197.9 |
|           |              |               |           |           |                           |
| цена      |     1154.923 |     243.06777 | 338.18862 | 1736.1794 |                   746.083 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Ноябрь    |              |               |           |           |                           |
| показания |      242.937 |       229.251 |           |           |                   12611.2 |
| расход    |        8.942 |         8.102 |    17.044 |           |                     225.6 |
|           |              |               |           |           |                           |
| цена      |    1459.6921 |     267.60906 | 399.34092 | 2126.6421 |                   850.512 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Декабрь   |              |               |           |           |                           |
| показания |      252.292 |       237.136 |           |           |                   12852.6 |
| расход    |        9.355 |         7.885 |     17.24 |           |                     241.4 |
|           |              |               |           |           | недоплата 1.52 => 911.598 |
| цена      |    1527.1102 |     260.44155 |  403.9332 | 2191.4850 |                   910.078 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2015, @59$2)::@5$3=@-1$3 - remote(bills2015, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2015, @59$6)::@7$2=@-2$2 * remote(tariffs, @4$2)::@7$3=@-2$3 * remote(tariffs, @4$3)::@7$4=@-2$4 * remote(tariffs, @4$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @4$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @4$2)::@12$3=@-2$3 * remote(tariffs, @4$3)::@12$4=@-2$4 * remote(tariffs, @4$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @4$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs, @4$2)::@17$3=@-2$3 * remote(tariffs, @4$3)::@17$4=@-2$4 * remote(tariffs, @4$4)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs, @4$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs, @4$2)::@22$3=@-2$3 * remote(tariffs, @4$3)::@22$4=@-2$4 * remote(tariffs, @4$4)::@22$5=$2 + $3 + $4::@22$6=@-2$6 * remote(tariffs, @4$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs, @4$2)::@27$3=@-2$3 * remote(tariffs, @4$3)::@27$4=@-2$4 * remote(tariffs, @4$4)::@27$5=$2 + $3 + $4::@27$6=@-2$6 * remote(tariffs, @4$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs, @4$2)::@32$3=@-2$3 * remote(tariffs, @4$3)::@32$4=@-2$4 * remote(tariffs, @4$4)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs, @4$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs, @4$2)::@37$3=@-2$3 * remote(tariffs, @4$3)::@37$4=@-2$4 * remote(tariffs, @4$4)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs, @4$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs, @5$2)::@42$3=@-2$3 * remote(tariffs, @5$3)::@42$4=@-2$4 * remote(tariffs, @5$4)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs, @5$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs, @5$2)::@47$3=@-2$3 * remote(tariffs, @5$3)::@47$4=@-2$4 * remote(tariffs, @5$4)::@47$5=$2 + $3 + $4::@47$6=@-2$6 * remote(tariffs, @5$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs, @5$2)::@52$3=@-2$3 * remote(tariffs, @5$3)::@52$4=@-2$4 * remote(tariffs, @5$4)::@52$5=$2 + $3 + $4::@52$6=@-2$6 * remote(tariffs, @5$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs, @5$2)::@57$3=@-2$3 * remote(tariffs, @5$3)::@57$4=@-2$4 * remote(tariffs, @5$4)::@57$5=$2 + $3 + $4::@57$6=@-2$6 * remote(tariffs, @5$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs, @5$2)::@62$3=@-2$3 * remote(tariffs, @5$3)::@62$4=@-2$4 * remote(tariffs, @5$4)::@62$5=$2 + $3 + $4::@62$6=@-2$6 * remote(tariffs, @5$5)

*** 2017
#+TBLNAME: bills2017
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |     Итого |               Электричество |
|           |        м3/м3 |         м3/м3 |           |           |                       кВт/ч |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Январь    |              |               |           |           |                             |
| показания |      263.379 |       245.922 |           |           |                     13051.8 |
| расход    |       11.087 |         8.786 |    19.873 |           |                       199.2 |
| ошибочно  |     оплачено |            по | предыдущ. |    тарифу |   переплата 1.50 => 699.684 |
| цена      |    1678.1283 |     271.22382 |  435.2187 | 2384.5708 |                     701.184 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Февраль   |              |               |           |           |                             |
| показания |      272.130 |       252.773 |           |           |                     13276.1 |
| расход    |        8.751 |         6.851 |    15.602 |           |                       224.3 |
|           |              |               |           |           |  недоплата 49.05 => 894.661 |
| цена      |    1428.5132 |     226.28853 | 365.55486 | 2020.3566 |                     845.611 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Март      |              |               |           |           |     электричество округляют |
| показания |      281.069 |       259.342 |           |           |                     13509.8 |
| расход    |        8.939 |         6.569 |    15.508 |           |                         233 |
|           |              |               |           |           |  "недоплата" 2.64 => 881.05 |
| цена      |    1459.2024 |     216.97407 | 363.35244 | 2039.5289 |                      878.41 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Апрель    |              |               |           |           |                             |
| показания |      291.911 |       267.574 |           |           |                     13783.7 |
| расход    |       10.842 |         8.232 |    19.074 |           |                         273 |
|           |              |               |           |           |                             |
| цена      |    1769.8481 |     271.90296 | 446.90382 | 2488.6549 |                     1029.21 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Май       |              |               |           |           |                             |
| показания |      300.354 |       274.788 |           |           |                     14016.8 |
| расход    |        8.443 |         7.214 |    15.657 |           |                         233 |
|           |              |               |           |           | переплачу 2 кВт/ч => 885.95 |
| цена      |    1378.2353 |     238.27842 | 366.84351 | 1983.3572 |                      878.41 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Июнь      |              |               |           |           |                             |
| показания |      305.938 |       283.214 |           |           |                     14264.5 |
| расход    |        5.584 |         8.426 |     14.01 |           |                         247 |
|           |              |               |           |           | переплачу 1 кВт/ч => 934.96 |
| цена      |    911.53216 |     278.31078 |  328.2543 | 1518.0972 |                      931.19 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Июль      |              |               |           |           |                             |
| показания |      311.897 |       290.254 |           |           |                     14444.8 |
| расход    |        5.959 |          7.04 |    12.999 |           |                         180 |
|           |              |               |           |           |                             |
| цена      |    1075.8975 |       249.216 | 326.53488 | 1651.6484 |                       727.2 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Август    |              |               |           |           |                             |
| показания |      314.117 |       293.945 |           |           |                     14572.0 |
| расход    |         2.22 |         3.691 |     5.911 |           |                         127 |
|           |              |               |           |           | переплата 28.88 =>    484.2 |
| цена      |      400.821 |      130.6614 | 148.48432 | 679.96672 |                      513.08 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Сентябрь  |              |               |           |           |                             |
| показания |      319.083 |       299.259 |           |           |                     14762.1 |
| расход    |        4.966 |         5.314 |     10.28 |           |                         190 |
|           |              |               |           |           | недоплата  4.04 =>    771.7 |
| цена      |     896.6113 |      188.1156 |  258.2336 | 1342.9605 |                       767.6 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Октябрь   |              |               |           |           |                             |
| показания |      326.360 |       305.754 |           |           |                     14991.4 |
| расход    |        7.277 |         6.495 |    13.772 |           |                         229 |
|           |        2.311 |               |           |           |    недоплата  0.06 => 925.1 |
| цена      |    1313.8624 |       229.923 | 345.95264 | 1889.7380 |                      925.16 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Ноябрь    |              |               |           |           |                             |
| показания |      334.944 |       313.046 |           |           |                     15252.6 |
| расход    |        8.584 |         7.292 |    15.876 |           |                         261 |
|           |              |               |           |           |                             |
| цена      |    1549.8412 |      258.1368 | 398.80512 | 2206.7831 |                     1054.44 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Декабрь   |              |               |           |           |                             |
| показания |      343.704 |       320.160 |           |           |                     15505.8 |
| расход    |         8.76 |         7.114 |    15.874 |           |                         253 |
|           |              |               |           |           |          6735.2699 - 138.79 |
| цена      |     1581.618 |      251.8356 | 398.75488 | 2232.2085 |                     1022.12 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2016, @59$2)::@5$3=@-1$3 - remote(bills2016, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2016, @59$6)::@7$2=@-2$2 * remote(tariffs, @4$2)::@7$3=@-2$3 * remote(tariffs, @4$3)::@7$4=@-2$4 * remote(tariffs, @4$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @4$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @5$2)::@12$3=@-2$3 * remote(tariffs, @5$3)::@12$4=@-2$4 * remote(tariffs, @5$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @5$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=floor(@-1$6 - @-6$6)::@17$2=@-2$2 * remote(tariffs, @5$2)::@17$3=@-2$3 * remote(tariffs, @5$3)::@17$4=@-2$4 * remote(tariffs, @5$4)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs, @5$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=floor(@-1$6 - @-6$6)::@22$2=@-2$2 * remote(tariffs, @5$2)::@22$3=@-2$3 * remote(tariffs, @5$3)::@22$4=@-2$4 * remote(tariffs, @5$4)::@22$5=$2 + $3 + $4::@22$6=@-2$6 * remote(tariffs, @5$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=floor(@-1$6 - @-6$6)::@27$2=@-2$2 * remote(tariffs, @5$2)::@27$3=@-2$3 * remote(tariffs, @5$3)::@27$4=@-2$4 * remote(tariffs, @5$4)::@27$5=$2 + $3 + $4::@27$6=@-2$6 * remote(tariffs, @5$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=floor(@-1$6 - @-6$6)::@32$2=@-2$2 * remote(tariffs, @5$2)::@32$3=@-2$3 * remote(tariffs, @5$3)::@32$4=@-2$4 * remote(tariffs, @5$4)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs, @5$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=floor(@-1$6 - @-6$6)::@37$2=@-2$2 * remote(tariffs, @6$2)::@37$3=@-2$3 * remote(tariffs, @6$3)::@37$4=@-2$4 * remote(tariffs, @6$4)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs, @6$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=floor(@-1$6 - @-6$6)::@42$2=@-2$2 * remote(tariffs, @6$2)::@42$3=@-2$3 * remote(tariffs, @6$3)::@42$4=@-2$4 * remote(tariffs, @6$4)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs, @6$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=floor(@-1$6 - @-6$6)::@47$2=@-2$2 * remote(tariffs, @6$2)::@47$3=@-2$3 * remote(tariffs, @6$3)::@47$4=@-2$4 * remote(tariffs, @6$4)::@47$5=$2 + $3 + $4::@47$6=@-2$6 * remote(tariffs, @6$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=floor(@-1$6 - @-6$6)::@52$2=@-2$2 * remote(tariffs, @6$2)::@52$3=@-2$3 * remote(tariffs, @6$3)::@52$4=@-2$4 * remote(tariffs, @6$4)::@52$5=$2 + $3 + $4::@52$6=@-2$6 * remote(tariffs, @6$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=floor(@-1$6 - @-6$6)::@57$2=@-2$2 * remote(tariffs, @6$2)::@57$3=@-2$3 * remote(tariffs, @6$3)::@57$4=@-2$4 * remote(tariffs, @6$4)::@57$5=$2 + $3 + $4::@57$6=@-2$6 * remote(tariffs, @6$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=floor(@-1$6 - @-6$6)::@62$2=@-2$2 * remote(tariffs, @6$2)::@62$3=@-2$3 * remote(tariffs, @6$3)::@62$4=@-2$4 * remote(tariffs, @6$4)::@62$5=$2 + $3 + $4::@62$6=@-2$6 * remote(tariffs, @6$5)

*** 2018
#+TBLNAME: bills2018
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод | Итого,               |            Электричество |
|           |        м3/м3 |         м3/м3 |           | Итого + Прочее       |                    кВт/ч |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Январь    |              |               |           |                      |                          |
| показания |      353.145 |       328.576 |           |                      |                  15762.5 |
| расход    |        9.441 |         8.416 |    17.857 |                      |                    256.7 |
|           |              |               |           |                      |                          |
| цена      |    1704.5726 |      297.9264 | 448.56784 | 2451.0668, 7103.8468 |                 1037.068 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Февраль   |              |               |           |                      |                          |
| показания |      360.805 |       336.533 |           |                      |                  16002.5 |
| расход    |         7.66 |         7.957 |    15.617 |                      |                     240. |
|           |              |               |           |                      | недоплата 1.22 => 970.82 |
|           |     1383.013 |      281.6778 | 392.29904 | 2056.9898, 6709.7698 |                    969.6 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Март      |              |               |           |                      |                          |
| показания |      367.641 |       341.187 |           |                      |                  16195.6 |
| расход    |        6.836 |         4.654 |     11.49 |                      |                    193.1 |
|           |              |               |           |                      |                          |
|           |    1234.2398 |      164.7516 |  288.6288 | 1687.6202, 6340.4002 |                  780.124 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Апрель    |              |               |           |                      |                          |
| показания |      374.575 |       352.601 |           |                      |                  16365.4 |
| расход    |        6.934 |        11.414 |    18.348 |                      |                    169.8 |
|           |              |               |           | + 563.34 = 7333.01   |   169.8 + 23.84 = 193.64 |
|           |    1251.9337 |      404.0556 | 460.90176 | 2116.8911, 6769.6711 |                  685.992 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Май       |              |               |           |                      |                          |
| показания |      381.636 |       361.800 |           |                      |                  16586.5 |
| расход    |        7.061 |         9.199 |     16.26 |                      |                    221.1 |
|           |              |               |           |                      |  п-плата 23.43 => 869.81 |
|           |    1274.8636 |      325.6446 |  408.4512 | 2008.9594, 6661.7394 |                  893.244 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Июнь      |              |               |           |                      |                          |
| показания |      387.575 |       371.396 |           |                      |                  16830.0 |
| расход    |        5.939 |         9.596 |    15.535 |                      |                    243.5 |
|           |              |               |           |                      |  п-плата 00.40 => 983.34 |
|           |    1072.2865 |      339.6984 |  390.2392 | 1802.2241, 6455.0041 |                   983.74 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Июль      |              |               |           | перерасчёт -495.57   |                          |
| показания |      393.147 |       379.362 |           | => 5846.21           |                  17024.4 |
| расход    |        5.572 |         7.966 |    13.538 |                      |                    194.4 |
|           |              |               |           |                      |  п-плата 00.40 => 784.97 |
|           |    1006.0246 |      281.9964 | 340.07456 | 1628.0956, 6341.7856 |                  785.376 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Август    |              |               |           |                      |                          |
| показания |      395.061 |       382.590 |           |                      |                  17194.7 |
| расход    |        1.914 |         3.228 |     5.142 |                      |                    170.3 |
|           |              |               |           |                      |                          |
|           |    360.84642 |     122.85768 | 138.88542 | 622.58952, 5336.2795 |                   732.29 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Сентябрь  |              |               |           |                      |                          |
| показания |      397.957 |       385.068 |           |                      |                  17317.7 |
| расход    |        2.896 |         2.478 |     5.374 |                      |                     123. |
|           |              |               |           |                      |                          |
|           |    545.98288 |      94.31268 | 145.15174 | 785.4473, 5499.1373  |                    528.9 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Октябрь   |              |               |           | долг 1151.56         |                          |
| показания |      403.379 |       389.984 |           | => 7353.79           |                  17478.9 |
| расход    |        5.422 |         4.916 |    10.338 |                      |                    161.2 |
|           |              |               |           |                      |                          |
|           |    1022.2097 |     187.10296 | 279.22938 | 1488.5420, 6202.2320 |                   693.16 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Ноябрь    |              |               |           |                      |                          |
| показания |      413.330 |       396.407 |           |                      |                  17705.1 |
| расход    |        9.951 |         6.423 |    16.374 |                      |                    226.2 |
|           |              |               |           |                      |                          |
|           |    1876.0620 |     244.45938 | 442.26174 | 2562.7831, 7276.4731 |                   972.66 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
| Декабрь   |              |               |           | перерасчёт -2140.30  |          недоплата 19.79 |
| показания |      422.941 |       402.024 |           | => 5014.9131         |                  17900.9 |
| расход    |        9.611 |         5.617 |    15.228 |                      |                    195.8 |
|           |              |               |           |                      |                => 861.73 |
|           |    1811.9618 |     213.78302 | 411.30828 | 2437.0531, 7155.2131 |                   841.94 |
|-----------+--------------+---------------+-----------+----------------------+--------------------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2017, @59$2)::@5$3=@-1$3 - remote(bills2017, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2017, @59$6)::@7$2=@-2$2 * remote(tariffs, @6$2)::@7$3=@-2$3 * remote(tariffs, @6$3)::@7$4=@-2$4 * remote(tariffs, @6$4)::@7$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @6$6)::@7$6=@-2$6 * remote(tariffs, @6$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @6$2)::@12$3=@-2$3 * remote(tariffs, @6$3)::@12$4=@-2$4 * remote(tariffs, @6$4)::@12$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @6$6)::@12$6=@-2$6 * remote(tariffs, @6$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs, @6$2)::@17$3=@-2$3 * remote(tariffs, @6$3)::@17$4=@-2$4 * remote(tariffs, @6$4)::@17$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @6$6)::@17$6=@-2$6 * remote(tariffs, @6$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs, @6$2)::@22$3=@-2$3 * remote(tariffs, @6$3)::@22$4=@-2$4 * remote(tariffs, @6$4)::@22$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @6$6)::@22$6=@-2$6 * remote(tariffs, @6$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs, @6$2)::@27$3=@-2$3 * remote(tariffs, @6$3)::@27$4=@-2$4 * remote(tariffs, @6$4)::@27$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @6$6)::@27$6=@-2$6 * remote(tariffs, @6$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs, @6$2)::@32$3=@-2$3 * remote(tariffs, @6$3)::@32$4=@-2$4 * remote(tariffs, @6$4)::@32$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @6$6)::@32$6=@-2$6 * remote(tariffs, @6$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs, @6$2)::@37$3=@-2$3 * remote(tariffs, @6$3)::@37$4=@-2$4 * remote(tariffs, @6$4)::@37$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @7$6)::@37$6=@-2$6 * remote(tariffs, @6$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs, @8$2)::@42$3=@-2$3 * remote(tariffs, @8$3)::@42$4=@-2$4 * remote(tariffs, @8$4)::@42$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @8$6)::@42$6=@-2$6 * remote(tariffs, @8$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs, @8$2)::@47$3=@-2$3 * remote(tariffs, @8$3)::@47$4=@-2$4 * remote(tariffs, @8$4)::@47$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @8$6)::@47$6=@-2$6 * remote(tariffs, @8$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs, @8$2)::@52$3=@-2$3 * remote(tariffs, @8$3)::@52$4=@-2$4 * remote(tariffs, @8$4)::@52$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @8$6)::@52$6=@-2$6 * remote(tariffs, @8$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs, @8$2)::@57$3=@-2$3 * remote(tariffs, @8$3)::@57$4=@-2$4 * remote(tariffs, @8$4)::@57$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @8$6)::@57$6=@-2$6 * remote(tariffs, @8$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs, @9$2)::@62$3=@-2$3 * remote(tariffs, @9$3)::@62$4=@-2$4 * remote(tariffs, @9$4)::@62$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @9$6)::@62$6=@-2$6 * remote(tariffs, @9$5)

*** 2019
#+TBLNAME: bills2019
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод | Итого,               | Электричество |
|           |        м3/м3 |         м3/м3 |           | Итого + Прочее       |         кВт/ч |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Январь    |              |               |           |                      |               |
| показания |      434.269 |       410.857 |           |                      |       18184.0 |
| расход    |       11.328 |         8.833 |    20.161 |                      |         283.1 |
|           |              |               |           |                      |               |
| цена      |    2135.6678 |     336.18398 | 544.54861 | 3016.4004, 7895.7004 |      1237.147 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Февраль   |              |               |           | перерасчёт -379.69   |               |
| показания |      443.961 |       418.066 |           | => 7248.8349         |       18457.6 |
| расход    |        9.692 |         7.209 |    16.901 |                      |         273.6 |
|           |              |               |           |                      |               |
|           |    1858.1502 |      278.9883 | 463.25641 | 2600.3949, 7628.5249 |      1195.632 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Март      |              |               |           | недоплата 1.02       |               |
| показания |      453.068 |       424.981 |           | => 7482.87           |       18699.6 |
| расход    |        9.107 |         6.915 |    16.022 | дополнительный долг  |          242. |
|           |              |               |           | => 541.98            |               |
|           |    1745.9940 |      267.6105 | 440.12434 | 2453.7288, 7481.8588 |       1057.54 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Апрель    |              |               |           |                      |               |
| показания |      461.136 |       432.766 |           |                      |       18923.2 |
| расход    |        8.068 |         7.785 |    15.853 |                      |         223.6 |
|           |              |               |           |                      |               |
|           |    1546.7970 |      301.2795 | 435.48191 | 2283.5584, 7317.2084 |       977.132 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Май       |              |               |           | недоплата 107.78     |               |
| показания |      470.529 |       442.321 |           | => 7832.53           |       19131.6 |
| расход    |        9.393 |         9.555 |    18.948 | оплатил 8К           |         208.4 |
|           |              |               |           |                      |               |
|           |    1800.8260 |      369.7785 | 520.50156 | 2691.1061, 7724.7561 |       910.708 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июнь      |              |               |           | переплата 579.01     | п-плата 13.88 |
| показания |      478.043 |       450.751 |           | => 6659.4468         |       19337.9 |
| расход    |        7.514 |          8.43 |    15.944 | оплатил 7К           |         206.3 |
|           |              |               |           |                      |    => 887.651 |
|           |    1440.5841 |       326.241 | 437.98168 | 2204.8068, 7238.4568 |       901.531 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июль      |              |               |           | недоплата 145.75     |  п-плата 1.31 |
| показания |      483.372 |       458.100 |           | => ?!?!?!?           |       19515.6 |
| расход    |        5.329 |         7.349 |    12.678 | оплатил 7.3К         |         177.7 |
|           |              |               |           |                      |     => 775.14 |
|           |    1021.6759 |      284.4063 | 348.26466 | 1654.3469, 6746.2469 |       776.549 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Август    |              |               |           | недоплата 37.92      | недопл. 29.13 |
| показания |      488.798 |       465.187 |           | => ?!?!?!?           |       19702.4 |
| расход    |        5.426 |         7.087 |    12.513 | оплатил 7К           |         186.8 |
|           |              |               |           |                      |    => 1004.07 |
|           |    1075.3789 |     286.88176 | 370.00941 | 1732.2701, 6824.1701 |        868.62 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Сентябрь  |              |               |           |                      |  п-пл. 105.39 |
| показания |      492.121 |       469.506 |           |                      |       19826.1 |
| расход    |        3.323 |         4.319 |     7.642 | оплатил 6.7К         |         123.7 |
|           |              |               |           |                      |               |
|           |    658.58537 |     174.83312 | 225.97394 | 1059.3924, 6151.2924 |       575.205 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Октябрь   |              |               |           | перерасчёт -117.48   |  п-пл. 438.80 |
| показания |      500.029 |       477.388 |           |                      |       20006.4 |
| расход    |        7.908 |         7.882 |     15.79 | плачу 7.5К           |         180.3 |
|           |              |               |           |                      |    => 733.005 |
|           |    1567.2865 |     319.06336 |  466.9103 | 2353.2602, 7445.1602 |       838.395 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Ноябрь    |              |               |           | переплата 1466.19    |               |
| показания |      506.952 |       485.093 |           |                      |       20229.7 |
| расход    |        6.923 |         7.705 |    14.628 | плачу по кв. 5978.97 |         223.3 |
|           |              |               |           |                      |               |
|           |    1372.0694 |      311.8984 | 432.54996 | 2116.5178, 7208.4178 |      1038.345 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Декабрь   |              |               |           | плачу по кв. 7213.45 |               |
| показания |      513.611 |       491.918 |           |                      |       20431.6 |
| расход    |        6.659 |         6.825 |    13.484 |                      |         201.9 |
|           |              |               |           |                      |               |
|           |    1319.7472 |       276.276 | 398.72188 | 1994.7451, 7091.6751 |       938.835 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2018, @59$2)::@5$3=@-1$3 - remote(bills2018, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2018, @59$6)::@7$2=@-2$2 * remote(tariffs, @10$2)::@7$3=@-2$3 * remote(tariffs, @10$3)::@7$4=@-2$4 * remote(tariffs, @10$4)::@7$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @10$6)::@7$6=@-2$6 * remote(tariffs, @10$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @11$2)::@12$3=@-2$3 * remote(tariffs, @11$3)::@12$4=@-2$4 * remote(tariffs, @11$4)::@12$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @11$6)::@12$6=@-2$6 * remote(tariffs, @11$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs, @12$2)::@17$3=@-2$3 * remote(tariffs, @12$3)::@17$4=@-2$4 * remote(tariffs, @12$4)::@17$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @12$6)::@17$6=@-2$6 * remote(tariffs, @12$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs, @13$2)::@22$3=@-2$3 * remote(tariffs, @13$3)::@22$4=@-2$4 * remote(tariffs, @13$4)::@22$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @13$6)::@22$6=@-2$6 * remote(tariffs, @13$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs, @13$2)::@27$3=@-2$3 * remote(tariffs, @13$3)::@27$4=@-2$4 * remote(tariffs, @13$4)::@27$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @13$6)::@27$6=@-2$6 * remote(tariffs, @13$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs, @13$2)::@32$3=@-2$3 * remote(tariffs, @13$3)::@32$4=@-2$4 * remote(tariffs, @13$4)::@32$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @13$6)::@32$6=@-2$6 * remote(tariffs, @13$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs, @14$2)::@37$3=@-2$3 * remote(tariffs, @14$3)::@37$4=@-2$4 * remote(tariffs, @14$4)::@37$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @14$6)::@37$6=@-2$6 * remote(tariffs, @14$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs, @15$2)::@42$3=@-2$3 * remote(tariffs, @15$3)::@42$4=@-2$4 * remote(tariffs, @15$4)::@42$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @15$6)::@42$6=@-2$6 * remote(tariffs, @15$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs, @15$2)::@47$3=@-2$3 * remote(tariffs, @15$3)::@47$4=@-2$4 * remote(tariffs, @15$4)::@47$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @15$6)::@47$6=@-2$6 * remote(tariffs, @15$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs, @16$2)::@52$3=@-2$3 * remote(tariffs, @16$3)::@52$4=@-2$4 * remote(tariffs, @16$4)::@52$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @16$6)::@52$6=@-2$6 * remote(tariffs, @16$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs, @16$2)::@57$3=@-2$3 * remote(tariffs, @16$3)::@57$4=@-2$4 * remote(tariffs, @16$4)::@57$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @16$6)::@57$6=@-2$6 * remote(tariffs, @16$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs, @17$2)::@62$3=@-2$3 * remote(tariffs, @17$3)::@62$4=@-2$4 * remote(tariffs, @17$4)::@62$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs, @17$6)::@62$6=@-2$6 * remote(tariffs, @17$5)

* 2020
** Tariffs
#+TBLNAME: tariffs2020
|----------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+---------+---------+-----------+---------|
| Услуга   | Электричество | Холодная вода | Горячая вода | Водоотвод | Отопление | Содержание | Взнос на |  Радио | Антенна | Домофон | Страховка |   Сумма |
|          |         кВт/ч |         м3/м3 |        м3/м3 |     м3/м3 | за 55.9м2 |   жил.пом. | кап.рем. |        |         |         |           |         |
|----------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+---------+---------+-----------+---------|
| Январь   |          4.65 |         40.48 |       198.19 |     29.57 |   1956.89 |    1704.39 |  1054.27 | 112.32 |     245 |      48 |    109.56 | 5230.43 |
| Февраль  |          4.65 |         40.48 |       198.19 |     29.57 |   2389.72 |    1704.39 |  1054.27 | 112.32 |     245 |      48 |    109.56 | 5663.26 |
| Март     |          4.65 |         40.48 |       198.19 |     29.57 |   1893.15 |    1704.39 |  1054.27 | 112.32 |     245 |      48 |    109.56 | 5166.69 |
| Апрель   |          4.65 |         40.48 |       198.19 |     29.57 |   1893.15 |    1704.39 |     0.00 | 117.92 |     245 |      48 |    109.56 | 4118.02 |
| Июнь     |          4.65 |         40.48 |       198.19 |     29.57 |   1893.15 |    1704.39 |     0.00 | 117.96 |     245 |      48 |    109.56 | 4118.06 |
| Июль     |          4.87 |         40.48 |       198.19 |     29.57 |   1954.67 |    1704.39 |  1054.27 | 117.96 |     245 |      48 |    109.56 | 5233.85 |
| Август   |          4.87 |         42.40 |       205.15 |     30.90 |   1954.67 |    1704.39 |  1054.27 | 117.96 |     245 |      48 |    109.56 | 5233.85 |
| Сентябрь |          4.87 |         42.30 |       205.15 |     30.90 |   1954.67 |    1704.39 |  1054.27 | 117.96 |     245 |      48 |    109.56 | 5233.85 |
| Декабрь  |          4.87 |         42.30 |       205.15 |     30.90 |   1954.67 |    1704.39 |  1054.27 | 117.96 |     245 |      48 |         0 | 5124.29 |
|----------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+---------+---------+-----------+---------|
#+TBLFM: $13=vsum($6..$12)
# $2..$5 not summed
** Bills
#+TBLNAME: bills2020
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод | Итого,               | Электричество |
|           |        м3/м3 |         м3/м3 |           | Вода, Вода + Тарифы  |         кВт/ч |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Январь    |              |               |           | плачу по кв. 7225.18 |               |
| показания |      520.852 |       499.316 |           |                      |       20662.1 |
| расход    |        7.241 |         7.398 |    14.639 |                      |         230.5 |
|           |              |               |           |                      |               |
| цена      |    1435.0938 |     299.47104 | 432.87523 | 2167.4401, 7397.8701 |      1071.825 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Февраль   |              |               |           | плачу по кв. 7270.40 |               |
| показания |      527.460 |       506.297 |           | перерасчёт -63.74    |       20899.4 |
| расход    |        6.608 |         6.981 |    13.589 |                      |         237.3 |
|           |              |               |           |                      |               |
| цена      |    1309.6395 |     282.59088 | 401.82673 | 1994.0571, 7657.3171 |      1103.445 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Март      |              |               |           | плачу по кв. 7160.75 |  недопл. 0.94 |
| показания |      535.044 |       512.854 |           |                      |       21146.3 |
| расход    |        7.584 |         6.557 |    14.141 |                      |         246.9 |
|           |              |               |           |                      |   => 1149.025 |
| цена      |    1503.0730 |     265.42736 | 418.14937 | 2186.6497, 7353.3397 |      1148.085 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Апрель    |              |               |           | плачу по кв. 6304.71 |               |
| показания |      545.316 |       522.073 |           |                      |       21507.2 |
| расход    |       10.272 |         9.219 |    19.491 |                      |         360.9 |
|           |              |               |           |                      |               |
| цена      |    2035.8077 |     373.18512 | 576.34887 | 2985.3417, 7103.3617 |      1678.185 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Май       |              |               |           | плачу по кв. 7103.41 |  недопл. 0.93 |
| показания |      552.408 |       528.600 |           |                      |       21775.1 |
| расход    |        7.092 |         6.527 |    13.619 |                      |         267.9 |
|           |              |               |           |                      |    => 1246.66 |
| цена      |    1405.5635 |     264.21296 | 402.71383 | 2072.4903, 6190.5103 |      1245.735 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июнь      |              |               |           | плачу по кв. 6190.54 |  недопл. 0.47 |
| показания |      561.644 |       537.100 |           |                      |       22065.6 |
| расход    |        9.236 |           8.5 |    17.736 |                      |         290.5 |
|           |              |               |           |                      |    => 1351.29 |
| цена      |    1830.4828 |        344.08 | 524.45352 | 2699.0163, 6817.0763 |      1350.825 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июль      |              |               |           | плачу по кв. 7932.86 |     переплата |
| показания |      566.926 |       544.695 |           |                      |       22270.4 |
| расход    |        5.282 |         7.595 |    12.877 |                      |         204.8 |
|           |              |               |           |                      |     => 993.61 |
| цена      |    1046.8396 |      307.4456 | 380.77289 | 1735.0581, 6968.9081 |       997.376 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Август    |              |               |           | плачу по кв. 7036.62 |     переплата |
| показания |      571.094 |       555.177 |           |                      |       22495.1 |
| расход    |        4.168 |        10.482 |     14.65 |                      |         224.7 |
|           |              |               |           |                      |               |
| цена      |     855.0652 |      444.4368 |   452.685 | 1752.187, 6986.037   |      1094.289 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Сентябрь  |              |               |           | плачу по кв. 6985.00 |  недопл. 1.47 |
| показания |      576.165 |       563.390 |           |                      |       22685.3 |
| расход    |        5.071 |         8.213 |    13.284 |                      |         190.2 |
|           |              |               |           |                      |     -> 927.74 |
| цена      |    1040.3157 |      347.4099 |  410.4756 | 1798.2012, 7032.0512 |       926.274 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Октябрь   |              |               |           | плачу по кв. 7032.05 |  п-пл. 151.94 |
| показания |      581.738 |       572.161 |           |                      |       22907.0 |
| расход    |        5.573 |         8.771 |    14.344 |                      |         221.7 |
|           |              |               |           |                      |    -> 927.379 |
| цена      |    1143.3010 |      371.0133 |  443.2296 | 1957.5439, 7191.3939 |      1079.679 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Ноябрь    |              |               |           | плачу по кв. 7191.39 |               |
| показания |      588.220 |       581.313 |           |                      |       23166.6 |
| расход    |        6.482 |         9.152 |    15.634 |                      |         259.6 |
|           |              |               |           |                      |               |
| цена      |    1329.7823 |      387.1296 |  483.0906 | 2200.0025, 7433.8525 |      1264.252 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Декабрь   |              |               |           | плачу по кв. 7324.29 |  п-плата 2.92 |
| показания |      594.851 |       589.148 |           |                      |       23412.7 |
| расход    |        6.631 |         7.835 |    14.466 |                      |         246.1 |
|           |              |               |           |                      |   -> 1195.587 |
| цена      |    1360.3497 |      331.4205 |  446.9994 | 2138.7696, 7263.0596 |      1198.507 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2019, @59$2)::@5$3=@-1$3 - remote(bills2019, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2019, @59$6)::@7$2=@-2$2 * remote(tariffs2020, @3$4)::@7$3=@-2$3 * remote(tariffs2020, @3$3)::@7$4=@-2$4 * remote(tariffs2020, @3$5)::@7$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @3$13)::@7$6=@-2$6 * remote(tariffs2020, @3$2)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs2020, @4$4)::@12$3=@-2$3 * remote(tariffs2020, @4$3)::@12$4=@-2$4 * remote(tariffs2020, @4$5)::@12$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @4$13)::@12$6=@-2$6 * remote(tariffs2020, @4$2)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs2020, @5$4)::@17$3=@-2$3 * remote(tariffs2020, @5$3)::@17$4=@-2$4 * remote(tariffs2020, @5$5)::@17$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @5$13)::@17$6=@-2$6 * remote(tariffs2020, @5$2)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs2020, @6$4)::@22$3=@-2$3 * remote(tariffs2020, @6$3)::@22$4=@-2$4 * remote(tariffs2020, @6$5)::@22$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @6$13)::@22$6=@-2$6 * remote(tariffs2020, @6$2)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs2020, @6$4)::@27$3=@-2$3 * remote(tariffs2020, @6$3)::@27$4=@-2$4 * remote(tariffs2020, @6$5)::@27$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @6$13)::@27$6=@-2$6 * remote(tariffs2020, @6$2)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs2020, @7$4)::@32$3=@-2$3 * remote(tariffs2020, @7$3)::@32$4=@-2$4 * remote(tariffs2020, @7$5)::@32$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @7$13)::@32$6=@-2$6 * remote(tariffs2020, @7$2)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs2020, @8$4)::@37$3=@-2$3 * remote(tariffs2020, @8$3)::@37$4=@-2$4 * remote(tariffs2020, @8$5)::@37$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @8$13)::@37$6=@-2$6 * remote(tariffs2020, @8$2)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs2020, @9$4)::@42$3=@-2$3 * remote(tariffs2020, @9$3)::@42$4=@-2$4 * remote(tariffs2020, @9$5)::@42$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @9$13)::@42$6=@-2$6 * remote(tariffs2020, @9$2)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs2020, @10$4)::@47$3=@-2$3 * remote(tariffs2020, @10$3)::@47$4=@-2$4 * remote(tariffs2020, @10$5)::@47$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @10$13)::@47$6=@-2$6 * remote(tariffs2020, @10$2)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs2020, @10$4)::@52$3=@-2$3 * remote(tariffs2020, @10$3)::@52$4=@-2$4 * remote(tariffs2020, @10$5)::@52$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @10$13)::@52$6=@-2$6 * remote(tariffs2020, @10$2)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs2020, @10$4)::@57$3=@-2$3 * remote(tariffs2020, @10$3)::@57$4=@-2$4 * remote(tariffs2020, @10$5)::@57$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @10$13)::@57$6=@-2$6 * remote(tariffs2020, @10$2)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs2020, @11$4)::@62$3=@-2$3 * remote(tariffs2020, @11$3)::@62$4=@-2$4 * remote(tariffs2020, @11$5)::@62$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2020, @11$13)::@62$6=@-2$6 * remote(tariffs2020, @11$2)

* 2021
** Tariffs
#+TBLNAME: tariffs2021
|----------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+---------+---------+---------|
| Услуга   | Электричество | Холодная вода | Горячая вода | Водоотвод | Отопление | Содержание | Взнос на |  Радио | Антенна | Домофон |   Сумма |
|          |         кВт/ч |         м3/м3 |        м3/м3 |     м3/м3 | за 55.9м2 |   жил.пом. | кап.рем. |        |         |         |         |
|----------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+---------+---------+---------|
| Январь   |          4.87 |         42.30 |       205.15 |     30.90 |   1954.67 |    1782.65 |  1091.17 | 117.96 |     245 |      48 | 5239.45 |
| Февраль  |          4.87 |         42.30 |       205.15 |     30.90 |   1809.39 |    1782.65 |  1091.17 | 117.96 |     245 |      48 | 5094.17 |
| Апрель   |          4.87 |         42.30 |       205.15 |     30.90 |   1809.39 |    1782.65 |  1091.17 | 122.70 |     245 |      48 | 5098.91 |
| Июль     |          4.87 |         42.30 |       205.15 |     30.90 |   1867.65 |    1782.65 |  1091.17 | 122.70 |     245 |      48 | 5157.17 |
| Август   |          4.87 |         43.57 |       211.67 |     32.02 |   1867.65 |    1782.65 |  1091.17 | 122.70 |     245 |      48 | 5157.17 |
| Сентябрь |          5.15 |         43.57 |       211.67 |     32.02 |   1867.65 |    1782.65 |  1091.17 | 122.70 |     245 |      48 | 5157.17 |
|----------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+---------+---------+---------|
#+TBLFM: $12=vsum($6..$11)
# $2..$5 not summed
** Bills
#+TBLNAME: bills2021
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод | Итого,               | Электричество |
|           |        м3/м3 |         м3/м3 |           | Вода, Вода + Тарифы  |         кВт/ч |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Январь    |              |               |           | плачу по кв. 7378.22 |  п-плата 0.48 |
| показания |      601.821 |       599.571 |           |                      |       23620.1 |
| расход    |         6.97 |        10.423 |    17.393 |                      |         207.4 |
|           |              |               |           |                      |  опл.кв. 1012 |
| цена      |    1429.8955 |      440.8929 |  537.4437 | 2408.2321, 7647.6821 |      1010.038 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Февраль   |              |               |           | плачу по кв. 7357.11 |  недопл. 0.48 |
| показания |      610.352 |       608.946 |           |                      |       23887.2 |
| расход    |        8.531 |         9.375 |    17.906 |                      |         267.1 |
|           |              |               |           |                      |   -> 1301.257 |
| цена      |    1750.1347 |      396.5625 |  553.2954 | 2699.9926, 7794.1626 |      1300.777 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Март      |              |               |           | плачу по кв. 7565.21 |    п-пл. 0.48 |
| показания |      616.628 |       616.942 |           |                      |       24056.6 |
| расход    |        6.276 |         7.996 |    14.272 |                      |         169.4 |
|           |              |               |           |                      |     -> 824.49 |
| цена      |    1287.5214 |      338.2308 |  441.0048 | 2066.757, 7160.927   |       824.978 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Апрель    |              |               |           | плачу по кв. 7394.63 |    п-пл. 1.94 |
| показания |      622.657 |       625.533 |           |                      |       24229.9 |
| расход    |        6.029 |         8.591 |     14.62 |                      |         173.3 |
|           |              |               |           |                      |     -> 842.03 |
| цена      |    1236.8494 |      363.3993 |   451.758 | 2052.0067, 7150.9167 |       843.971 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Май       |              |               |           | плачу по кв. 7150.92 |    п-пл. 1.46 |
| показания |      628.345 |       631.450 |           |                      |       24375.0 |
| расход    |        5.688 |         5.917 |    11.605 |                      |         145.1 |
|           |              |               |           |                      |     -> 705.17 |
| цена      |    1166.8932 |      250.2891 |  358.5945 | 1775.7768, 6874.6868 |       706.637 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июнь      |              |               |           | плачу по кв. 6874.68 |    п-пл. 1.46 |
| показания |      633.567 |       639.293 |           |                      |       24525.8 |
| расход    |        5.222 |         7.843 |    13.065 |                      |         150.8 |
|           |              |               |           |                      |     -> 732.93 |
| цена      |    1071.2933 |      331.7589 |  403.7085 | 1806.7607            |       734.396 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июль      |              |               |           |                      |  недопл. 1.96 |
| показания |      637.458 |       648.861 |           | по квитанции:        |       24674.1 |
| расход    |        3.891 |         9.568 |    13.459 | 6963.9307            |         148.3 |
|           |              |               |           |                      |     -> 724.18 |
| цена      |    798.23865 |      404.7264 |  415.8831 | 1618.8482            |       722.221 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Август    |              |               |           | плачу по кв. 6828.62 |               |
| показания |      640.474 |       659.749 |           | по квитанции:        |       24847.2 |
| расход    |        3.016 |        10.888 |    13.904 | 6776.0182            |         173.1 |
|           |              |               |           |                      |     -> 890,95 |
| цена      |    638.39672 |     474.39016 | 445.20608 | 1557.9930            |       842.997 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Сентябрь  |              |               |           | плачу по кв. 6715.17 |               |
| показания |      644.155 |       667.150 |           | по квитанции:        |       24967.2 |
| расход    |        3.681 |         7.401 |    11.082 | 6715.163             |          120. |
|           |              |               |           |                      | плачу по кв.: |
| цена      |    779.15727 |     322.46157 | 354.84564 | 1456.4645            |          618. |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Октябрь   |              |               |           | плачу по кв. 6613.64 |               |
| показания |      648.781 |       674.956 |           | по квитанции:        |       25122.2 |
| расход    |        4.626 |         7.806 |    12.432 | 6613.6345            |          155. |
|           |              |               |           |                      |               |
| цена      |    979.18542 |     340.10742 | 398.07264 | 1717.3655            |        798.25 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Ноябрь    |              |               |           | плачу по кв. 6873.84 |               |
| показания |      654.629 |       683.399 |           | по квитанции:        |       25300.7 |
| расход    |        5.848 |         8.443 |    14.291 | 6874.5355            |         178.5 |
|           |              |               |           |                      |               |
| цена      |    1237.8462 |     367.86151 | 457.59782 | 2063.3055            |       919.275 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Декабрь   |              |               |           | плачу по кв. 7221.17 |               |
| показания |      660.147 |       697.436 |           | по квитанции:        |       25465.7 |
| расход    |        5.518 |        14.037 |    19.555 | 7220.4755            |          165. |
|           |              |               |           |                      |               |
| цена      |    1167.9951 |     611.59209 |  626.1511 | 2405.7383            |        849.75 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2020, @59$2)::@5$3=@-1$3 - remote(bills2020, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2020, @59$6)::@7$2=@-2$2 * remote(tariffs2021, @3$4)::@7$3=@-2$3 * remote(tariffs2021, @3$3)::@7$4=@-2$4 * remote(tariffs2021, @3$5)::@7$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2021, @3$12)::@7$6=@-2$6 * remote(tariffs2021, @3$2)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs2021, @4$4)::@12$3=@-2$3 * remote(tariffs2021, @4$3)::@12$4=@-2$4 * remote(tariffs2021, @4$5)::@12$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2021, @4$12)::@12$6=@-2$6 * remote(tariffs2021, @4$2)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs2021, @4$4)::@17$3=@-2$3 * remote(tariffs2021, @4$3)::@17$4=@-2$4 * remote(tariffs2021, @4$5)::@17$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2021, @4$12)::@17$6=@-2$6 * remote(tariffs2021, @4$2)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs2021, @5$4)::@22$3=@-2$3 * remote(tariffs2021, @5$3)::@22$4=@-2$4 * remote(tariffs2021, @5$5)::@22$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2021, @5$12)::@22$6=@-2$6 * remote(tariffs2021, @5$2)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs2021, @5$4)::@27$3=@-2$3 * remote(tariffs2021, @5$3)::@27$4=@-2$4 * remote(tariffs2021, @5$5)::@27$5=$2 + $3 + $4, $2 + $3 + $4 + remote(tariffs2021, @5$12)::@27$6=@-2$6 * remote(tariffs2021, @5$2)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs2021, @5$4)::@32$3=@-2$3 * remote(tariffs2021, @5$3)::@32$4=@-2$4 * remote(tariffs2021, @5$5)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs2021, @5$2)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$5=@-3$5 + remote(tariffs2021, @6$12)::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs2021, @6$4)::@37$3=@-2$3 * remote(tariffs2021, @6$3)::@37$4=@-2$4 * remote(tariffs2021, @6$5)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs2021, @6$2)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$5=@-3$5 + remote(tariffs2021, @7$12)::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs2021, @7$4)::@42$3=@-2$3 * remote(tariffs2021, @7$3)::@42$4=@-2$4 * remote(tariffs2021, @7$5)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs2021, @7$2)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$5=@-3$5 + remote(tariffs2021, @8$12)::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs2021, @8$4)::@47$3=@-2$3 * remote(tariffs2021, @8$3)::@47$4=@-2$4 * remote(tariffs2021, @8$5)::@47$5=$2 + $3 + $4::@47$6=@-2$6 * remote(tariffs2021, @8$2)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$5=@-3$5 + remote(tariffs2021, @8$12)::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs2021, @8$4)::@52$3=@-2$3 * remote(tariffs2021, @8$3)::@52$4=@-2$4 * remote(tariffs2021, @8$5)::@52$5=$2 + $3 + $4::@52$6=@-2$6 * remote(tariffs2021, @8$2)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$5=@-3$5 + remote(tariffs2021, @8$12)::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs2021, @8$4)::@57$3=@-2$3 * remote(tariffs2021, @8$3)::@57$4=@-2$4 * remote(tariffs2021, @8$5)::@57$5=$2 + $3 + $4::@57$6=@-2$6 * remote(tariffs2021, @8$2)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$5=@-3$5 + remote(tariffs2021, @8$12)::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs2021, @8$4)::@62$3=@-2$3 * remote(tariffs2021, @8$3)::@62$4=@-2$4 * remote(tariffs2021, @8$5)::@62$5=$2 + $3 + $4::@62$6=@-2$6 * remote(tariffs2021, @8$2)

* 2022
** Tariffs
#+TBLNAME: tariffs2022
|---------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+--------+---------+---------+---------|
| Услуга  | Электричество | Холодная вода | Горячая вода | Водоотвод | Отопление | Содержание | Взнос на |  Радио | Обр.с  | Антенна | Домофон |   Сумма |
|         |         кВт/ч |         м3/м3 |        м3/м3 |     м3/м3 | за 55.9м2 |   жил.пом. | кап.рем. |        | ТКО    |         |         |         |
|---------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+--------+---------+---------+---------|
| Январь  |          5.15 |         43.57 |       211.67 |     32.02 |   1867.65 |    1998.61 |  1173.34 | 122.70 |        |     245 |      48 |  5455.3 |
| Февраль |          5.15 |         43.57 |       211.67 |     32.02 |   2026.52 |    1998.61 |  1173.34 | 122.70 |        |     245 |      48 | 5614.17 |
| Апрель  |          5.15 |         43.57 |       211.67 |     32.02 |   2026.52 |    1998.61 |  1173.34 | 129.90 |        |     245 |      48 | 5621.37 |
| Июль    |          5.15 |         43.57 |       211.67 |     32.02 |   2135.95 |    1592.03 |  1173.34 | 129.90 | 406.58 |     245 |      48 |  5730.8 |
| Август  |          5.15 |         45.88 |       223.04 |     35.53 |   2135.95 |    1998.61 |  1173.34 | 129.90 |        |     245 |      48 |  5730.8 |
|---------+---------------+---------------+--------------+-----------+-----------+------------+----------+--------+--------+---------+---------+---------|
#+TBLFM: $13=vsum($6..$12)
# $2..$5 not summed
** Bills
#+TBLNAME: bills2022
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |               Итого, | Электричество |
|           |        м3/м3 |         м3/м3 |           |  Вода, Вода + Тарифы |         кВт/ч |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Январь    |              |               |           | плачу по кв. 7861.04 |  п-плата 2.58 |
| показания |      666.545 |       698.768 |           |                      |       25636.4 |
| расход    |        6.398 |         1.332 |      7.73 |                      |         170.7 |
|           |              |               |           |                      | оп.кв. 345.04 |
| цена      |    1354.2647 |      58.03524 |  247.5146 |            1659.8145 |       879.105 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Февраль   |              |               |           | плачу по кв. ----.-- |               |
| показания |      672.676 |       706.483 |           |                      |       25825.9 |
| расход    |        6.131 |         7.715 |    13.846 |            7115.1145 |         189.5 |
|           |              |               |           |                      |     -> 973.35 |
| цена      |    1297.7488 |     336.14255 | 443.34892 |            2077.2403 |       975.925 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Март      |              |               |           | плачу по кв. ----.-- |               |
| показания |      679.416 |       711.724 |           |                      |       25997.9 |
| расход    |         6.74 |         5.241 |    11.981 |            7691.4103 |          172. |
|           |              |               |           |                      |               |
| цена      |    1426.6558 |     228.35037 | 383.63162 |            2038.6378 |         885.8 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Апрель    |              |               |           | плачу по кв. 7660.00 |               |
| показания |      685.920 |       718.032 |           |                      |       26151.1 |
| расход    |        6.504 |         6.308 |    12.812 |            7660.0078 |         153.2 |
|           |              |               |           |                      |  оп.кв. 793.1 |
| цена      |    1376.7017 |     274.83956 | 410.24024 |            2061.7815 |        788.98 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Май       |              |               |           | плачу по кв. 7683.15 |               |
| показания |      694.137 |       726.386 |           |                      |       26344.9 |
| расход    |        8.217 |         8.354 |    16.571 |            7683.1515 |         193.8 |
|           |              |               |           |                      | оп.кв. 993.95 |
| цена      |    1739.2924 |     363.98378 | 530.60342 |            2633.8796 |        998.07 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июнь      |              |               |           | плачу по кв. 9017.98 |               |
| показания |      700.700 |       733.964 |           |   перерасчёт +762.74 |       26509.6 |
| расход    |        6.563 |         7.578 |    14.141 |            8255.2496 |         164.7 |
|           |              |               |           |                      | оп.кв. 849.75 |
| цена      |    1389.1902 |     330.17346 | 452.79482 |            2172.1585 |       848.205 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Июль      |              |               |           | плачу по кв. 8665.69 |               |
| показания |      705.525 |       741.611 |           |   перерасчёт +762.74 |       26643.9 |
| расход    |        4.825 |         7.647 |    12.472 |            7902.9585 |         134.3 |
|           |              |               |           |                      | оп.кв. 710.82 |
| цена      |    1021.3078 |     333.17979 | 399.35344 |            1753.8410 |       691.645 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
| Август    |              |               |           | плачу по кв. 8363.68 |               |
| показания |      709.494 |       751.460 |           |   перерасчёт +762.74 |       26828.1 |
| расход    |        3.969 |         9.849 |    13.818 |             7484.641 |         184.2 |
|           |              |               |           |                      |               |
| цена      |    885.24576 |     451.87212 | 490.95354 |            1828.0714 |        948.63 |
|-----------+--------------+---------------+-----------+----------------------+---------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2021, @59$2)::@5$3=@-1$3 - remote(bills2021, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2021, @59$6)::@7$2=@-2$2 * remote(tariffs2022, @3$4)::@7$3=@-2$3 * remote(tariffs2022, @3$3)::@7$4=@-2$4 * remote(tariffs2022, @3$5)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs2022, @3$2)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$5=@-3$5 + remote(tariffs2022, @3$13)::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs2022, @3$4)::@12$3=@-2$3 * remote(tariffs2022, @3$3)::@12$4=@-2$4 * remote(tariffs2022, @3$5)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs2022, @3$2)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$5=@-3$5 + remote(tariffs2022, @4$13)::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs2022, @4$4)::@17$3=@-2$3 * remote(tariffs2022, @4$3)::@17$4=@-2$4 * remote(tariffs2022, @4$5)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs2022, @4$2)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$5=@-3$5 + remote(tariffs2022, @5$13)::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs2022, @5$4)::@22$3=@-2$3 * remote(tariffs2022, @5$3)::@22$4=@-2$4 * remote(tariffs2022, @5$5)::@22$5=$2 + $3 + $4::@22$6=@-2$6 * remote(tariffs2022, @5$2)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$5=@-3$5 + remote(tariffs2022, @5$13)::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs2022, @5$4)::@27$3=@-2$3 * remote(tariffs2022, @5$3)::@27$4=@-2$4 * remote(tariffs2022, @5$5)::@27$5=$2 + $3 + $4::@27$6=@-2$6 * remote(tariffs2022, @5$2)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$5=@-3$5 + remote(tariffs2022, @5$13)::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs2022, @5$4)::@32$3=@-2$3 * remote(tariffs2022, @5$3)::@32$4=@-2$4 * remote(tariffs2022, @5$5)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs2022, @5$2)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$5=@-3$5 + remote(tariffs2022, @6$13)::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs2022, @6$4)::@37$3=@-2$3 * remote(tariffs2022, @6$3)::@37$4=@-2$4 * remote(tariffs2022, @6$5)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs2022, @6$2)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$5=@-3$5 + remote(tariffs2022, @7$13)::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs2022, @7$4)::@42$3=@-2$3 * remote(tariffs2022, @7$3)::@42$4=@-2$4 * remote(tariffs2022, @7$5)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs2022, @7$2)
